Aula De Dataframes - Tabelas Com Linhas E Colunas
Linhas = Registros = Nomes, Códigos
Colunas = Propriedade Ou Propriedade

Padrão de uso :
Pandas = pd

In [28]:
import pandas as pd
print('DataFrame apartir de um dicionário')
dict={
    'idade':[36,35],
    'genero':['f','m'],
    'peso':[63,68],
    'altura':[1.67,1.69]
}
data = pd.DataFrame(dict)
print(data)

DataFrame apartir de um dicionário
   idade genero  peso  altura
0     36      f    63    1.67
1     35      m    68    1.69

In [29]:
print('DataFrame apartir de uma lista')
matrix = [[39,'M',83.5,1.68],[37,'F',54,1.57]]
cols = ['idade','genero','peso','altura']
data =pd.DataFrame(matrix,columns = cols)#argumento columns = cols => nomes de colunas, sem o mesmo vira como indices iniciando em zero
print(data)

lin = 1
col = 2

#print(data.iloc[lin][col]) # iloc: usa var criada para se localizar entre colchetes separados
#print(data.loc[0]['idade']) #loc usa o indice e o nome da coluna entre colchetes separados para se localizar

print(data.iat[lin,col]) #iat: usa var criada para se localizar entre colchetes unicos separados por virgula
print(data.at[0,'idade']) #at: usa o indice e o nome da coluna entre colchetes unicos separados por virgula

DataFrame apartir de uma lista
   idade genero  peso  altura
0     39      M  83.5    1.68
1     37      F  54.0    1.57
54.0
39

In [30]:
carros = {
    'modelo': ['Maruti 800 AC','Maruti Wagon R LXI Minor','Hyundai Verna 1.6 SX', 'Datsun RediGO T Option', 'Honda Amaze VX i-DTEC', 'Maruti Alto LX BSIII', 'Hyundai Xcent 1.2 Kappa S', 'Tata Indigo Grand Petrol', 'Hyundai Creta 1.6 VTVT S', 'Maruti Celerio Green VXI', 'Chevrolet Sail 1.2 Base', 'Tata Indigo Grand Petrol', 'Toyota Corolla Altis 1.8 VL CVT'],
    'ano': [2007, 2007, 2012, 2017, 2014, 2007, 2016, 2014, 2015, 2017, 2015, 2014, 2018],
    'preço': [60000, 135000, 600000, 250000, 450000, 140000, 550000, 240000, 850000, 365000, 260000, 250000, 1650000],
    'combustivel': ['Petrol', 'Petrol', 'Diesel', 'Petrol', 'Diesel', 'Petrol', 'Petrol', 'Petrol', 'Petrol', 'CNG', 'Petrol', 'Petrol', 'Petrol']
}
tabela = pd.DataFrame(carros)
print(tabela)
print()
print('Modelo: ',tabela.iat[5,0],'R$:', tabela.iat[5,2])
print('Modelo: ',tabela.iat[10,0],'(',tabela.iat[10,1],') :', tabela.iat[10,3])

                             modelo   ano    preço combustivel
0                     Maruti 800 AC  2007    60000      Petrol
1          Maruti Wagon R LXI Minor  2007   135000      Petrol
2              Hyundai Verna 1.6 SX  2012   600000      Diesel
3            Datsun RediGO T Option  2017   250000      Petrol
4             Honda Amaze VX i-DTEC  2014   450000      Diesel
5              Maruti Alto LX BSIII  2007   140000      Petrol
6         Hyundai Xcent 1.2 Kappa S  2016   550000      Petrol
7          Tata Indigo Grand Petrol  2014   240000      Petrol
8          Hyundai Creta 1.6 VTVT S  2015   850000      Petrol
9          Maruti Celerio Green VXI  2017   365000         CNG
10          Chevrolet Sail 1.2 Base  2015   260000      Petrol
11         Tata Indigo Grand Petrol  2014   250000      Petrol
12  Toyota Corolla Altis 1.8 VL CVT  2018  1650000      Petrol

Modelo:  Maruti Alto LX BSIII R$: 140000
Modelo:  Chevrolet Sail 1.2 Base ( 2015 ) : Petrol

Métodos com Dataframe

In [31]:
tabela.shape # mostra as dimenssões da dataframe, qtd de linhas e colunas
tabela.size # qtd de elementos/células
len(tabela)

13

In [32]:
base = pd.read_csv("https://storage.googleapis.com/pedagogico/formacao-dados/tabela_clientes.csv")
(base)

,nome,telefone,email,cep,estado
0,Hayden Nicholson,1-262-848-2640,et.netus.et@yahoo.com,58078-354,Paraná
1,Echo Cameron,(640) 218-1137,volutpat.nunc@outlook.edu,91058-985,Pará
2,Len Porter,(657) 370-2202,penatibus.et.magnis@aol.ca,88613-734,Santa Catarina
3,Pearl Stout,(245) 345-4683,et@protonmail.org,58931-887,Rio Grande do Sul
4,Abbot Knapp,1-475-850-6484,donec.vitae.erat@icloud.ca,56633-071,Pará
...,...,...,...,...,...
495,Serina Austin,1-524-231-1438,scelerisque.sed.sapien@protonmail.ca,40541-477,Ceará
496,Bertha Terrell,(284) 622-5871,egestas.urna.justo@icloud.couk,12111-445,Goiás
497,Herrod Chapman,(511) 488-2172,dictum.ultricies@protonmail.net,21530-106,Rio de Janeiro
498,Guy Roman,1-300-865-3432,porttitor.vulputate@outlook.edu,25543-434,Goiás
499,Skyler Blackburn,1-665-585-2373,natoque.penatibus@aol.couk,66329-853,Rio Grande do Sul

In [33]:
print('Resolução')
print('1- A quantidade de clientes, pela quantidade de linhas  é: ',len(base))
print('1- A quantidade de clientes pelo indice através de shape é: ',base.shape[0])
print('2- A quantidade de informações é: ',base.shape[1])
print('3- O tamanho da base é: ',base.size)

Resolução
1- A quantidade de clientes, pela quantidade de linhas  é:  500
1- A quantidade de clientes pelo indice através de shape é:  500
2- A quantidade de informações é:  5
3- O tamanho da base é:  2500

In [34]:
tabela_a = pd.read_csv('d:\\Python\\analise_dados_cubos_engie\\tabela_clientes.csv')
(tabela_a)
print(len(tabela_a),' usando o len')
print(tabela_a.shape[0],' usando shape mais o indice de linhas [0]')
print(tabela_a.shape[1],' usando shape mais 0 indice de colunas [1]')
print((tabela_a.size),' usando size total de elenmtos')

500  usando o len
500  usando shape mais o indice de linhas [0]
5  usando shape mais 0 indice de colunas [1]
2500  usando size total de elenmtos

Sumários com Dataframes
Resumindo informações

In [35]:
import seaborn as sns
iris = sns.load_dataset('iris')
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [36]:
print('Mostra primeiras 5 linhas da tabela')
iris.head()

Mostra primeiras 5 linhas da tabela

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [37]:
print('Mostra 5 últimas linhas da tabela')
iris.tail()

Mostra 5 últimas linhas da tabela

     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [38]:
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [39]:
print('Ordenar os valores Crescente ou Descrescente de uma coluna')
iris.sort_values('sepal_length', ascending=False)

Ordenar os valores Crescente ou Descrescente de uma coluna

     sepal_length  sepal_width  petal_length  petal_width    species
131           7.9          3.8           6.4          2.0  virginica
135           7.7          3.0           6.1          2.3  virginica
122           7.7          2.8           6.7          2.0  virginica
117           7.7          3.8           6.7          2.2  virginica
118           7.7          2.6           6.9          2.3  virginica
..            ...          ...           ...          ...        ...
41            4.5          2.3           1.3          0.3     setosa
42            4.4          3.2           1.3          0.2     setosa
38            4.4          3.0           1.3          0.2     setosa
8             4.4          2.9           1.4          0.2     setosa
13            4.3          3.0           1.1          0.1     setosa

[150 rows x 5 columns]

In [40]:
iris.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

In [41]:
iris.count()

sepal_length    150
sepal_width     150
petal_length    150
petal_width     150
species         150
dtype: int64

In [42]:
iris.min()

sepal_length       4.3
sepal_width        2.0
petal_length       1.0
petal_width        0.1
species         setosa
dtype: object

In [43]:
iris.max()

sepal_length          7.9
sepal_width           4.4
petal_length          6.9
petal_width           2.5
species         virginica
dtype: object

In [44]:
print('mean')
iris_objeto = iris.select_dtypes(include=['object']).columns #identificar onde estão valores nulos NAN
iris_sem_objeto = iris.drop(columns=iris_objeto)
iris_sem_objeto
iris_sem_objeto.mean()

mean

sepal_length    5.843333
sepal_width     3.057333
petal_length    3.758000
petal_width     1.199333
dtype: float64

In [45]:
print('Mediama')
iris_sem_objeto.median()

Mediama

sepal_length    5.80
sepal_width     3.00
petal_length    4.35
petal_width     1.30
dtype: float64

In [46]:
print('Exercises')
import seaborn as sns
ping = sns.load_dataset('penguins')
(ping)

Exercises

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female
...,...,...,...,...,...,...,...
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,Female
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,Male
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,Female
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,Male

In [47]:
print('2 - Tipos de Váriáveis: ') 
ping.dtypes

2 - Tipos de Váriáveis:

species               object
island                object
bill_length_mm       float64
bill_depth_mm        float64
flipper_length_mm    float64
body_mass_g          float64
sex                   object
dtype: object

In [48]:
print('3 - 5 primeiras linhas: ') 
ping.head()

3 - 5 primeiras linhas:

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female

In [49]:
print('4 - 5 últimas linhas: ') 
ping.tail()

4 - 5 últimas linhas:

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,Female
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,Male
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,Female
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,Male

In [50]:
print('5: Quantidade de observações não nulos ') 
ping.count()

5: Quantidade de observações não nulos

species              344
island               344
bill_length_mm       342
bill_depth_mm        342
flipper_length_mm    342
body_mass_g          342
sex                  333
dtype: int64

In [95]:
print('6: Valores Minimos e Maximos ') 
ping_sem_nulos = ping.dropna()
(ping_sem_nulos)
ping_sem_nulos.count()

6: Valores Minimos e Maximos

species              333
island               333
bill_length_mm       333
bill_depth_mm        333
flipper_length_mm    333
body_mass_g          333
sex                  333
dtype: int64

In [52]:
ping_sem_nulos.min()

species              Adelie
island               Biscoe
bill_length_mm         32.1
bill_depth_mm          13.1
flipper_length_mm     172.0
body_mass_g          2700.0
sex                  Female
dtype: object

In [53]:
ping_sem_nulos.max()

species                 Gentoo
island               Torgersen
bill_length_mm            59.6
bill_depth_mm             21.5
flipper_length_mm        231.0
body_mass_g             6300.0
sex                       Male
dtype: object

In [54]:
colunas_objeto = ping.select_dtypes(include=['object']).columns
(colunas_objeto)
coluna_sem_objeto = ping.drop(columns=colunas_objeto)
(coluna_sem_objeto)
coluna_sem_objeto.min()
coluna_sem_objeto.max()
coluna_sem_objeto.mean()
coluna_sem_objeto.median()

bill_length_mm         44.45
bill_depth_mm          17.30
flipper_length_mm     197.00
body_mass_g          4050.00
dtype: float64

In [55]:
print('selecionar valores')
ping.columns
ping[['island','sex']]
import seaborn as sns
iris = sns.load_dataset('iris')
iris
iris.loc[0:4,'sepal_length':'petal_length'] # seleciona linhas de 0:4 e colunas entre nome : nome
ping.loc[0:4,'island':'sex']
iris.loc[[0,3,4],['sepal_length','petal_length']]

selecionar valores

   sepal_length  petal_length
0           5.1           1.4
3           4.6           1.5
4           5.0           1.4

In [69]:
print('1- Informações Coletadas abaixo: ')
#base = pd.read_csv("https://storage.googleapis.com/pedagogico/formacao-dados/tabela_clientes.csv")
base = pd.read_csv("d:\\Python\\analise_dados_cubos_engie\\tabela_clientes.csv")
#usar join e columns 
print('Dados Coletados dos clientes: ',', '.join(base.columns))

1- Informações Coletadas abaixo:
Dados Coletados dos clientes:  nome, telefone, email, cep, estado

In [76]:
print('2-3- Lista de nomes e  Telefones, ordenados de A a Z ')
#base.loc[0:500,'nome':'telefone'].sort_values('nome',ascending=True)
base_telefone = base[['nome','telefone']].sort_values('nome',ascending=True)
print(base_telefone)

2-3- Lista de nomes e  Telefones, ordenados de A a Z
                nome        telefone
86        Aaron Byrd  1-123-343-7816
4        Abbot Knapp  1-475-850-6484
226   Abdul Petersen  (745) 597-2584
393      Abel Garner  (624) 917-6370
23   Abigail Solomon  1-565-818-9313
..               ...             ...
321     Zeph Preston  (880) 532-3480
313       Zeph Sykes  1-328-275-8090
72      Zephania Cox  1-228-876-3948
170    Zephania Ruiz  1-576-831-2548
490   Zorita Baldwin  (359) 129-7668

[500 rows x 2 columns]

In [83]:
print('Exporta nova base de dados')
base_telefone.to_csv('clientes_telefones.csv')
import shutil
caminho_arquivo = 'D:\\Python\\analise_dados_cubos_engie\\aulas_python\\clientes_telefones.csv'
caminho_destino ='C:\\Users\\rfsra\\OneDrive\\Desktop\\clientes_telefones.csv'
shutil.copyfile(caminho_arquivo, caminho_destino)

Exporta nova base de dados

'C:\\Users\\rfsra\\OneDrive\\Desktop\\clientes_telefones.csv'

In [108]:
consulta = pd.read_csv('d:\\Python\\analise_dados_cubos_engie\\consulta.csv')
print('Dados Coletados dos clientes: ',', '.join(consulta.columns))
consulta.count()
consulta_dados = consulta[['Data Movto','Valor','Complemento']]
consulta_dados

Dados Coletados dos clientes:  Data Movto, Unnamed: 1, Unnamed: 2, Unnamed: 3, Valor, Conta, Unnamed: 6, Complemento, Unnamed: 8, Unnamed: 9, Unnamed: 10, Estabelecimento, D/C, Unnamed: 13, Status, Unnamed: 15, Partida, Unnamed: 17

    Data Movto      Valor  Complemento
0   05/01/2024     392,86          NaN
1   08/01/2024    2086,36          NaN
2   09/01/2024      54213          NaN
3   09/01/2024    9383,99          NaN
4   10/01/2024       6000          NaN
5   10/01/2024      28000          NaN
6   11/01/2024      22000          NaN
7   11/01/2024   40392,67          NaN
8   12/01/2024      15490          NaN
9   12/01/2024    5960,28          NaN
10  16/01/2024    3416,67          NaN
11  17/01/2024     386,16          NaN
12  17/01/2024       2500          NaN
13  17/01/2024       1850          NaN
14  17/01/2024     349,15          NaN
15  17/01/2024    6457,77          NaN
16  18/01/2024    19638,5          NaN
17  18/01/2024      19900          NaN
18  18/01/2024  178430,17          NaN
19  18/01/2024   43860,26          NaN
20  19/01/2024     406,66          NaN
21  19/01/2024        500          NaN
22  22/01/2024       3700          NaN
23  25/01/2024        700          NaN
24  31/01/2024        286          NaN
25  31/01/2024      10000          NaN
26  31/01/2024   14712,14          NaN
27  31/01/2024      22680          NaN

In [112]:
print('Exportar o arquivo')
consulta_dados.to_csv('consulta_dados.csv')
import shutil
caminho_arquivo = 'D:\\Python\\analise_dados_cubos_engie\\aulas_python\\consulta_dados.csv'
caminho_destino ='C:\\Users\\rfsra\\OneDrive\\Desktop\\consulta_dados.csv'
shutil.copyfile(caminho_arquivo, caminho_destino)

Exportar o arquivo

'C:\\Users\\rfsra\\OneDrive\\Desktop\\consulta_dados.csv'

In [119]:
print('Operações Matemáticas em tabelas')
dict2={
    'idade':[36,35],
    'peso':[63,68],
    'altura':[1.6,1.8]
}
dict3={
    'idade':[30,31],
    'peso':[69,80],
    'altura':[1.7,1.9]
}
data2 = pd.DataFrame(dict2)
data3 = pd.DataFrame(dict3)
print(data2)
print()
print(data3)

Operações Matemáticas em tabelas
   idade  peso  altura
0     36    63     1.6
1     35    68     1.8

   idade  peso  altura
0     30    69     1.7
1     31    80     1.9

In [120]:
data2.add(2) #adiciona valor constante 2 a cada elemto da tabela

   idade  peso  altura
0     38    65     3.6
1     37    70     3.8

In [124]:
data_somados = data3.add(data2) #adiciona os valor da tabela2 na tabela 3 = somando todos por elemento
data_somados

   idade  peso  altura
0     66   132     3.3
1     66   148     3.7

In [125]:
data_sub = data3.sub(data2)
data_sub

   idade  peso  altura
0     -6     6     0.1
1     -4    12     0.1

In [127]:
base_vendas = pd.read_json("https://storage.googleapis.com/pedagogico/formacao-dados/tabela_vendas.json")
base_vendas

       id_compra  codigo_produto             region  quantidade  valor_produto
0    EJF38SUC4TS            1002             Paraná           1           3.81
1    YDQ17YLX1MY            1264          São Paulo           8          77.51
2    DNK32LCC1RB            2344           Maranhão           3          16.92
3    DHJ68CCE3OP            9273           Maranhão           1          66.14
4    RQD46YMW6JT            1264     Santa Catarina           3          38.45
..           ...             ...                ...         ...            ...
495  KPM96WTU5LI            8974           Maranhão           4           7.41
496  ZIT25VJB8GX             823  Rio Grande do Sul           0          14.62
497  FKL37EMH1AS            1002     Rio de Janeiro           9          46.22
498  SNY86RFP1YM            1002     Rio de Janeiro          10          10.75
499  OZC87SGF9WE            1002           Maranhão           6          94.89

[500 rows x 5 columns]

In [134]:
print('Criar Coluna Valor Total')
print(base_vendas.columns) # mostra as colunas
print(base_vendas.count())
# Criando Coluna Total
base_vendas['total'] = base_vendas['quantidade'].mul(base_vendas['valor_produto'])
base_vendas

Criar Coluna Valor Total
Index(['id_compra', 'codigo_produto', 'region', 'quantidade', 'valor_produto'], dtype='object')
id_compra         500
codigo_produto    500
region            500
quantidade        500
valor_produto     500
dtype: int64

,id_compra,codigo_produto,region,quantidade,valor_produto,total
0,EJF38SUC4TS,1002,Paraná,1,3.81,3.81
1,YDQ17YLX1MY,1264,São Paulo,8,77.51,620.08
2,DNK32LCC1RB,2344,Maranhão,3,16.92,50.76
3,DHJ68CCE3OP,9273,Maranhão,1,66.14,66.14
4,RQD46YMW6JT,1264,Santa Catarina,3,38.45,115.35
...,...,...,...,...,...,...
495,KPM96WTU5LI,8974,Maranhão,4,7.41,29.64
496,ZIT25VJB8GX,823,Rio Grande do Sul,0,14.62,0.00
497,FKL37EMH1AS,1002,Rio de Janeiro,9,46.22,415.98
498,SNY86RFP1YM,1002,Rio de Janeiro,10,10.75,107.50
499,OZC87SGF9WE,1002,Maranhão,6,94.89,569.34

In [193]:
#simulando acréscimo de 5% e desconto de 10%
base_vendas['adititvo 5%'] = base_vendas['total'].mul(1.05)
base_vendas
base_vendas['desconto 10%'] = base_vendas['total'].mul(0.9)
base_vendas
print('Média com Aditivo de 5% no total de cada item :''\n', base_vendas[['adititvo 5%']].mean())
print('Mediana do Desconto de 10% no total de cada item :''\n',base_vendas[['desconto 10%']].median())

Média com Aditivo de 5% no total de cada item :
 adititvo 5%    264.222357
dtype: float64
Mediana do Desconto de 10% no total de cada item :
 desconto 10%    169.137
dtype: float64